---
kind: enumMember
id: F:Autodesk.Revit.DB.InsertOrientation.Slanted
enum: Autodesk.Revit.DB.InsertOrientation
source: html/56071e06-8677-f30a-f026-425dc1d98dd2.htm
---
# Autodesk.Revit.DB.InsertOrientation.Slanted

Insert is aligned with the Slanted wall's slant direction.